openssl-customnameconstraints.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-03 Wed 22:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>openssl custom name constraints</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">openssl custom name constraints</h1>
<p>
<span class="timestamp-wrapper"><span class="timestamp">[2022-07-07 Thu]</span></span>: Warning: cross-signing other CA's to add your own
constraints does not work on latest openssl versions. see <a href="https://security.stackexchange.com/questions/262929/openssl-cross-sign-non-self-signed-certificate">this
security stackexchange post</a> for more information.
</p>

<p>
adapted from <a href="https://serverfault.com/a/764699/973375">this ServerFault post</a> and <a href="https://systemoverlord.com/2020/06/14/private-ca-with-x-509-name-constraints.html">this blogpost</a>.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. making your own name-constrained CA</a></li>
<li><a href="#org0000001">2. signing stuff with it</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> making your own name-constrained CA</h2>
<div class="outline-text-2" id="text-1">
<p>
make a <code>name-constraint.ini</code> file
</p>

<div class="org-src-container">
<pre class="src src-ini">[ req ]
distinguished_name      = req_distinguished_name
keyUsage                = critical, keyCertSign, cRLSign
[ domain_ca ]
basicConstraints = critical, CA:TRUE
nameConstraints         = critical, permitted;DNS:.example.com
subjectKeyIdentifier    = hash
authorityKeyIdentifier  = keyid,issuer:always
[ req_distinguished_name ]
</pre>
</div>

<p>
make your ca with the name constraints 
</p>

<div class="org-src-container">
<pre class="src src-sh">openssl req -new -x509 -days 3650 -newkey rsa:4096 -sha512 -extensions domain_ca -utf8 -out my-ca.crt -keyout my-ca.key -subj '/C=US/O=Example/OU=CA' -config name-constraint.ini
</pre>
</div>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> signing stuff with it</h2>
<div class="outline-text-2" id="text-2">
<p>
make an <code>altname.ini</code> file (you only have to do this once) 
</p>

<div class="org-src-container">
<pre class="src src-ini">subjectAltName          = ${ENV::CERT_SAN}
</pre>
</div>

<p>
sign the third party
</p>


<div class="org-src-container">
<pre class="src src-sh">CERT_SAN=DNS:meow.example.com openssl x509 -in third_party.crt -CA my-ca.crt -CAkey my-ca.key -set_serial 69 -sha512 -extfile altname.ini -out domain-cross.crt
</pre>
</div>

<p>
on newer versions of openssl, you might need <code>openssl x509 -x509toreq</code> to convert the third party ca to a csr, however <i>this requires its private key</i>: 
</p>

<div class="org-src-container">
<pre class="src src-sh">openssl x509 -x509toreq -in third_party.crt -signkey third_party.key -out third_party.csr
</pre>
</div>

<p>
now you can sign the certificate request
</p>

<div class="org-src-container">
<pre class="src src-sh">CERT_SAN=DNS:meow.example.com openssl x509 -in third_party.csr -CA my-ca.crt -CAkey my-ca.key -set_serial 69 -sha512 -extfile altname.ini -out domain-cross.crt
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
